In [1]:
%matplotlib inline
import pandas as pd

In [2]:
from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))

In [3]:
cast = pd.read_csv('data/cast.csv', index_col=None)
cast.head()

                               title  year       name   type character     n
0                    Suuri illusioni  1985     Homo $  actor    Guests  22.0
1     Gangsta Rap: The Glockumentary  2007  Too $hort  actor   Himself   NaN
2                  Menace II Society  1993  Too $hort  actor   Lew-Loc  27.0
3  Porndogs: The Adventures of Sadie  2009  Too $hort  actor     Bosco   3.0
4                 Stop Pepper Palmer  2014  Too $hort  actor   Himself   NaN

In [4]:
release_dates = pd.read_csv('data/release_dates.csv', index_col=None,
                                      parse_dates=['date'], infer_datetime_format=True)
release_dates.head()

                           title  year      country       date
0          #73, Shaanthi Nivaasa  2007        India 2007-06-15
1  #AnonOccupy: Bio of a Villain  2015          USA 2015-11-05
2                        #Beings  2015      Romania 2015-01-29
3         #Ewankosau saranghaeyo  2015  Philippines 2015-01-21
4             #Nerealnaya lyubov  2014       Russia 2014-02-13

### Wygeneruj wykres słupkowy miesięcy, w których filmy z "Christmas" w tytule wyprodukowano w USA

### Utwórz wydruk slupkowy (bar plot) dla miesięcy, w których wyprodukowano w USA tytuły filmów zaczynajace się "The Hobbit".

### Utwórz "bar plot" dni tygodnia w których wyprodukowano w USA filmy z "Romance" w tytule.

### Utwórz "bar plot" dni tygodni w których powstały filmy w USA ze słowem "Action" w tytule.

### Z jaką datą wyprodukowano od 1990 r. w USA poszczególne filmy z Judi Dench?

### W których miesiącach produkowano w USA filmy z Judi Dench?

### W których miesiącach produkowano w USA filmy z Tomem Cruise?

## Koniec cz. 5